{
  "basics": {
    "name": "Shingo Omura",
    "label": "Software Developer, Techincal Writer / Translator.",
    "picture": "",
    "email": "everpeace@gmail.com",
    "website": "http://everpeace.github.io",
    "summary": "Being involved in emergent software technology research especially in distributed/concurrent systems.  Previous work has involved architecture design or development for large enterprise softwares by object-oriented design/programming, aspect-oriented programming, software patterns and enterprise integration patterns. In private software engineer life, being involved in enjoying technical knowlege acquision and contribution in Open Source Software community, especially in functional programming, actor-oriented programming and reactive programming in Scala(Akka) and Go. My rigid foundation of programming comes from my study experience in Theoretical Computer Sience, especially in Graph Theory and Distributed Algorithm (Self Stabilization).",
    "location": {
      "postalCode": "CA 94404",
      "city": "San Mateo",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "everpeace",
        "url": "http://github.com/everpeace"
      },
      {
        "network": "LinkedIn",
        "username": "shingoomura",
        "url": "https://www.linkedin.com/in/shingoomura"
      },
      {
        "network": "Twitter",
        "username": "everpeace",
        "url": "http://twitter.com/everpeace"
      }
    ]
  },
  "skills": [
    {
      "name": "Programming Languages",
      "level": "Intermediate -- Advanced",
      "keywords": [
        "Java", "Scala", "Ruby"
      ]
    },
    {
      "name": "Practical Software Design",
      "level": "Advanced",
      "keywords": [
        "Object Oriented Design/Programming",
        "Aspect Oriented Programming",
        "Software Design Pattern",
        "Enterprise Integration Pattern",
        "Domain Driven Design"
      ]
    },
    {
      "name": "Frameworks/Tools (Java)",
      "level": "Intermediate -- Advanced",
      "keywords": [
        "Spring, JPA/Hibernate",
        "J2EE, JAX-*(RS, WS, ..)",
        "JUnit, some Mocking tools(EasyMock, jMockit)", "Guice", "ant, maven"
      ]
    },
    {
      "name": "Frameworks/Tools (Scala)",
      "level": "Intermediate -- Advanced",
      "keywords": [
        "Scalaz",
        "Akka",
        "ScalaCheck",
        "SBT"
      ]
    }

  ],
  "work": [
    {
      "company": "OGIS International, Inc.",
      "position": "Researcher/Architect",
      "website": "http://www.ogis-international.com",
      "startDate": "2012-05-28",
      "summary": "cutting-edge emergent software technology research",
      "highlights": [
        "Emergent virtualization technology research project. (Docker)",
        "Cluster scheduler research project. (Mesos, Yarn, Omega)",
        "In-memory computing technology research project. (Spark)",
        "Fault-tolerant service oriented architecture research project. (Netflix OSSs)",
        "Web API related technology research project. (RAML, Swagger)"
      ]
    },
    {
      "company": "OGIS-RI, Co., Ltd.",
      "position": "Software Architect",
      "website": "http://www.ogis-ri.co.jp",
      "startDate": "2007-04-01",
      "summary": "Software Architect, Object Oriented Modeling Consultant",
      "highlights": [
        "Developing lightweight workflow engine for some Japanese Mega Bank.",
        "Architecting/Developing large enterprise core applications with Spring Framework.",
        "Building web service integration infrastructure with Mule ESB.",
        "Developed Amazon S3 transport for Mule ESB.",
        "UML modeling consulting for production planning system in manufacturing system for next-generation semiconductor."
      ]
    },
    {
      "company": "Self-employed",
      "position": "Technical Writer/Translator",
      "startDate": "2007-04-01",
      "summary": "Give an overview of your responsibilities at the company",
      "highlights": [
        "Programming Scala, O'Reilly Japan, 2011. (co-translation)",
        "ThoughtWorks Anthology: Essays on Software Technology and Innovation, O'Reilly Japan, 2008. (co-translation)"
      ]
    }
  ],
  "volunteer": [
    {
      "position": "OSS Software Developer",
      "startDate": "2012-05-28",
      "highlights": [
        "Apache Mesos: Chef Cookboos for Mesos, Vagrant tool for spinning up mesos cluster",
        "Marathon: Event Subscription API.",
        "RxJava: Monad related integrations with Scalaz."
      ]
    },
    {
      "position": "Translator",
      "startDate": "2008-04-01",
      "highlights": [
        "Typeclassopedia (http://typeclassopedia.bitbucket.org/), 2012",
        "The Core Protocol V3, 2008"
      ]
    }
  ],
  "education": [
    {
      "institution": "Nagoya Institute of Technology",
      "area": "Information Engineering",
      "studyType": "Completed Ph.D. program without a Ph.D. degree",
      "startDate": "2004-04-01",
      "endDate": "2010-03-31"
    },
    {
      "institution": "Nagoya Institute of Technology",
      "area": "Information Engineering",
      "studyType": "Master of Engineering",
      "startDate": "2002-04-01",
      "endDate": "2004-03-31"
    },
    {
      "institution": "Nagoya Institute of Technology",
      "area": "Computer Science and Electrical Engineering",
      "studyType": "Bachelor of Engineering",
      "startDate": "1998-04-01",
      "endDate": "2002-03-31"
    }
  ],
  "awards": [
    {
      "title": "Best Speaker Award of Developers Summit 2009",
      "date": "2009-02-13",
      "awarder": "Shoeisha",
      "summary": "awarded to my talk \"Encouragement for Object Calisthenics\"(as a co-speaker)."
    }
  ],
  "publications": [
    {
      "name": "Neighborhood Broadcasting in undirected de Bruijn and Kautz Networks",
      "publisher": "Institute of Electronics, Information and Communication Engineers",
      "releaseDate": "2005-01-01",
      "website": "http://ci.nii.ac.jp/naid/110003214139",
      "summary": "This paper considers a neighborhood broadcasting protocol in undirected de Bruijn and Kautz networks. The neighborhood broadcasting problem(NBP) is the problem of disseminating a message from an originator vertex to only its neighbors. Our protocol works under the single-port and half-duplex model and solves NBP in 5log_2(n+1) + O(1) time units on the undirected de Bruijn graph UB(n,d) with n^d vertices and the undirected Kautz graph UK(n,d) with n^d + n^(d-1) vertices, where 2n is the maximum degree of these graphs. This completion time is asymptotically optimal in this model."
    },
    {
      "name": "An Optimal Certificate Dispersal Algorithm for Mobile Ad Hoc Networks",
      "publisher": "Institute of Electronics, Information and Communication Engineers",
      "releaseDate": "2005-05-01",
      "website": "http://ci.nii.ac.jp/naid/110003213439",
      "summary": "In this paper, we focus on the problem that in an ad hoc network, how to send a message securely between two users using the certificate dispersal system. In this system, special data called certificate is issued between two users and these issued certificates are stored among the network. Our final purpose on this certificate dispersal problem is to construct certificate graphs with lower dispersability cost which indicates the average number of certificates stored in each node in an ad hoc network. As our first step, when a certificate graph is given, we construct two efficient certificate dispersal algorithms for strongly connected graphs and directed graphs in this paper. We can show that for a strongly connected graph G=(V, E) and a directed graph H=(V′, E′), new upper bounds on dispersability cost on the average number of certificates stored in one node are O(D_G+|E|/|V|) and O(p_G^d_<max>+|E′|/|V′|) respectively, where D_G is the diameter of G, d_<max> is the maximum diameter of strongly connected components of H and p_G is the number of strongly connected components of H. Furthermore, we give some new lower bounds for the problem and we also show that our algorithms are optimal for several graph classes."
    },
    {
      "name": "An Approximation Algorithm for Minimum Certificate Dispersal Problems",
      "publisher": "Institute of Electronics, Information and Communication Engineers",
      "releaseDate": "2006-02-01",
      "website": "http://ci.nii.ac.jp/naid/110004656505",
      "summary": "We consider a network, where a special data called certificate is issued between two users, and all certificates issued by the users in the network can be represented by a directed graph. For any two users u and v, when u needs to send a message to v securely, v's public-key is needed. The user u can obtain v's public-key using the certificates stored in u and v. We need to disperse the certificates to the users such that when a user wants to send a message to the other user securely, there are enough certificates in them to get the reliable public-key. In this paper, when a certificate graph and a set of communication requests are given, we consider the problem to disperse the certificates among the nodes in the network, such that the communication requests are satisfied and the total number of certificates stored in the nodes is minimized. We formulate this problem as MINIMUM CERTIFICATE DISPERSAL (MCD for short). We show that MCD is NP-Complete, even if its input graph is restricted to a strongly connected graph. We also present a polynomial-time 2-approximation algorithm MinPivot for strongly connected graphs, when the communication requests satisfy some restrictions. We introduce some graph classes for which MinPivot can compute optimal dispersals, such as trees, rings, and some Cartesian products of graphs."
    },
    {
      "name": "A Self-stabilizing Protocol for k-hop Clustering with Solid-discs on Sensor Networks(Technical Report)",
      "publisher": "Institute of Electronics, Information and Communication Engineers",
      "releaseDate": "2006-11-27",
      "website": "http://www.ieice.org/ken/paper/20061204tApR/eng/",
      "summary": "In this paper, we study a clustering that partitions a multi hop wireless sensor network into non-overlapping and approximately equal-sized clusters, called a k-hop cluster with [k/2]-hop solid-disc (Definition is described in Section 2.2). This clustering makes it possible to provide efficient communication control, and construction of robust and reliable sensor networks. When a cluster is viewed as a virtual sensor, the [k/2]-hop solid-disc requirement guarantees robustness and reliability of the virtual sensor. This property also realizes for cluster-head to aggregate sensor data from all directions and collect geometrically meaningful data. We propose a memory-effcient self-stabilizing protocol for the fc-hop clustering with [k/2]-hop solid-disc property. Self-stabilizing systems can automatically recover from arbitrary transient failures in finite time. Compared with former literature [5], [19] which solved the same problem, our protocol achieves the clustering by using a smaller amount of information which is maintained in each local sensor. Our protocol works under no assumptions about special ability of nodes such as getting coordination of sensors and measuring distances between neighboring sensors. Note that the same algorithm with the paper was reported independently in [12]."
    }
  ],
  "languages": [
    {
      "language": "Japanese",
      "fluency": "Native"
    },
    {
      "language": "English",
      "fluency": "Professional working proficiency"
    }
  ],
  "interests": [
    {
      "name": "Highly Concurrent Systems",
      "keywords": [
        "Actor Programming",
        "Distributed Algorithms",
        "Self stabilization algorithms"
      ]
    },
    {
      "name": "Abstract Math and its applications",
      "keywords": [
        "Category Theory",
        "(Co)Monadic programmig in functional programming languages",
        "Coherent Specification Design using lightweight formal methods and model verifications."
      ]
    }
  ]
}
